import SupportQuestionBox from "../SupportQuestionBox/SupportQuestionBox";

export default function SupportQuestions(): JSX.Element {
  return (
    <section className="flex flex-col gap-6">
      <h3 className="font-medium text-lg m-auto">شاید برای شما هم سوال باشد</h3>
      <section className="grid gap-x-8 gap-y-6 sm:grid-cols-2 sm:grid-rows-2">
        <SupportQuestionBox
          title="چرا با اینکه پرداخت را انجام داده‌ام، خدمتی دریافت نکرده‌ام؟"
          text="اگر با وجود پرداخت هزینه، خدمتی دریافت نکردید، در صورت پرداخت هزینه از طریق درگاه بانکی موضوع را از طریق پشتیبانی بانک پیگیری کنید اما در صورتی که پرداخت با استفاده از درگاه کافه بازار انجام شده با پشتیبانی بازار تماس بگیرید."
        />
        <SupportQuestionBox
          title="چگونه به رد شدن آگهی خود اعتراض کنم؟"
          text="اگر فکر می‌کنید آگهیتان به‌اشتباه رد شده است، می‌توانید از قسمت اعتراض به رد شدن آگهی در صفحه مدیریت آگهی، اعتراضتان را ثبت کنید تا آگهی شما دوباره بررسی شود."
        />
        <SupportQuestionBox
          title="چگونه آگهی مورد نظر خود را در دیوار پیدا کنم؟"
          text="با استفاده از روش‌های مختلفی مانند دسته‌بندی‌ها، فیلتر‌گذاری و استفاده از نوار جستجو، می‌توانید آگهی مورد نظر خود را پیدا کنید."
        />
        <SupportQuestionBox
          title="چرا وضعیت آگهی من «در انتظار پرداخت» است؟"
          text="اگر وضعیت آگهی شما در صفحهٔ مدیریت آگهی‌ به صورت «در انتظار پرداخت» نمایش داده شود به این معناست که آگهی شما در دسته‌‌ای است که برای انتشار نیاز به پرداخت دارد یا تعداد سهمیهٔ آگهی رایگان شما در آن دسته‌بندی تمام شده است."
        />
      </section>
    </section>
  );
}
